---
kind: method
id: M:Autodesk.Revit.DB.FilterInverseRule.SetInnerRule(Autodesk.Revit.DB.FilterRule)
source: html/084e6fe7-7661-5111-26a0-1313d7442f0d.htm
---
# Autodesk.Revit.DB.FilterInverseRule.SetInnerRule Method

Gets the rule being inverted.

## Syntax (C#)
```csharp
public void SetInnerRule(
	FilterRule innerRule
)
```

## Parameters
- **innerRule** (`Autodesk.Revit.DB.FilterRule`) - The rule to invert.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null